[
  {
    "title": "Building a Full-Stack Portfolio with Next.js and ASP.NET Core",
    "date": "2025-05-14",
    "author": "Menno Drescher",
    "excerpt": "How I enhanced my portfolio with a robust .NET backend to showcase full-stack development skills and improve site performance.",
    "categories": [".NET", "Next.js", "Portfolio", "ASP.NET Core"],
    "content": "# Building a Full-Stack Portfolio with Next.js and ASP.NET Core\\n\\nAs developers, our portfolios are not just showcases of our work, but living demonstrations of our technical abilities. While my Next.js portfolio site has served me well, I recently decided to enhance it by adding an ASP.NET Core backend. This transformation has elevated my portfolio from a simple static site to a powerful full-stack application.\\n\\n## Why Add .NET to a Next.js Portfolio?\\n\\nNext.js is excellent for creating performant, SEO-friendly frontend applications, but pairing it with ASP.NET Core brings several advantages:\\n\\n1. **Showcasing Full-Stack Expertise**: Demonstrates proficiency in both modern JavaScript frameworks and enterprise-grade backend technologies\\n2. **Enhanced Performance**: ASP.NET Core's high-performance capabilities for handling data operations\\n3. **Advanced Features**: Simplified implementation of complex features like real-time analytics and secure admin panels\\n4. **Enterprise Readiness**: Shows potential employers your ability to work with technologies commonly used in enterprise environments\\n\\n## Architecture Overview\\n\\nThe architecture I implemented follows a clean separation of concerns with Next.js frontend and ASP.NET Core backend.\\n\\n## Key Features Implemented\\n\\n### 1. Performance-Optimized Blog Engine\\nI replaced the file-based blog with a SQL Server database managed by Entity Framework Core.\\n\\n### 2. Cross-Posting Analytics Dashboard\\nTrack blog posts cross-posted to platforms like Hashnode and Dev.to with performance metrics.\\n\\n### 3. Secure Admin Panel with JWT Authentication\\nThe admin experience is now significantly improved with proper authentication.\\n\\n### 4. Contact Form with Email Integration\\nIntegrated contact form with database storage and email notifications.\\n\\n## Conclusion\\n\\nAdding an ASP.NET Core backend to my Next.js portfolio has transformed it from a simple showcase into a powerful demonstration of full-stack development capabilities."
  },
  {
    "title": "A Disruptive Rebel: Risk for Planned Business Engagements",
    "date": "2025-05-10",
    "author": "Menno Drescher",
    "excerpt": "Exploring the risks and opportunities of engaging a disruptive rebel in planned business boundary initiatives.",
    "categories": ["Risk", "Business Strategy", "Innovation"],
    "content": "# A Disruptive Rebel: Risk for Planned Business Engagement\\n\\nEngaging a disruptive rebel in a business context can be both a risk and an opportunity. While such individuals often challenge the status quo and drive innovation, their approach may also create friction within established boundaries and processes.\\n\\n## What is a Disruptive Rebel?\\nA disruptive rebel is someone who questions existing norms, introduces unconventional ideas, and is willing to take risks to achieve breakthrough results.\\n\\n## Potential Risks\\n- **Cultural Resistance**: Established teams may resist change\\n- **Process Disruption**: Standard operating procedures may be challenged\\n- **Reputational Impact**: Aggressive disruption can affect brand perception\\n- **Compliance Issues**: May overlook regulatory requirements\\n\\n## Potential Opportunities\\n- **Innovation Acceleration**: New ideas and approaches can lead to competitive advantage\\n- **Market Expansion**: Challenging boundaries may open new markets\\n- **Talent Attraction**: Culture that welcomes rebels can attract creative thinkers\\n\\n## Conclusion\\n\\nManaging disruptive rebels requires careful balance between innovation and stability."
  }
]
